In [ ]:
# Day X â€“ Pandas Data Manipulation and Data Cleaning

### ðŸŽ¯ Goal
To learn advanced Pandas operations such as merging, concatenating, joining DataFrames, pivot tables,
file handling with CSVs, and basic data cleaning techniques used in real-world data analysis and Machine Learning.

In [2]:
import numpy as np
import pandas as pd

#Pandas Merging, Joining and Concatenating

In [2]:
#concatinating
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

      Name  Age    Address Qualification
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [5]:
frames = [df, df1]
print(pd.concat(frames))   # used when cloumns are same and rows are different or continous

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd
4    Abhi   17     Nagpur         Btech
5  Ayushi   14     Kanpur           B.A
6  Dhiraj   12  Allahabad          Bcom
7  Hitesh   52    Kannuaj        B.hons

In [6]:
data1 = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification  Mobile No
0     Jai   27     Nagpur           Msc         97
1  Princi   24     Kanpur            MA         91
2  Gaurav   22  Allahabad           MCA         58
3    Anuj   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2  Gaurav   22  Allahabad           MCA    1000
3    Anuj   32    Kannuaj           Phd    2000
6  Dhiraj   12  Allahabad          Bcom    3000
7  Hitesh   52    Kannuaj        B.hons    4000

In [9]:
res = pd.concat([df, df1], axis = 1, join="inner")
print(res) # used when we want common rows in same datasets with all cloumns

     Name  Age    Address Qualification  Mobile No    Name  Age    Address  \
2  Gaurav   22  Allahabad           MCA         58  Gaurav   22  Allahabad
3    Anuj   32    Kannuaj           Phd         76    Anuj   32    Kannuaj

  Qualification  Salary
2           MCA    1000
3           Phd    2000

In [10]:
res2 = pd.concat([df, df1], axis=1, join="outer")
print(res2) #used when we want all the rows and all the cloumns

     Name   Age    Address Qualification  Mobile No    Name   Age    Address  \
0     Jai  27.0     Nagpur           Msc       97.0     NaN   NaN        NaN
1  Princi  24.0     Kanpur            MA       91.0     NaN   NaN        NaN
2  Gaurav  22.0  Allahabad           MCA       58.0  Gaurav  22.0  Allahabad
3    Anuj  32.0    Kannuaj           Phd       76.0    Anuj  32.0    Kannuaj
6     NaN   NaN        NaN           NaN        NaN  Dhiraj  12.0  Allahabad
7     NaN   NaN        NaN           NaN        NaN  Hitesh  52.0    Kannuaj

  Qualification  Salary
0           NaN     NaN
1           NaN     NaN
2           MCA  1000.0
3           Phd  2000.0
6          Bcom  3000.0
7        B.hons  4000.0

In [11]:
res = pd.concat([df, df1], ignore_index=True)
res

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
4  Gaurav   22  Allahabad           MCA        NaN  1000.0
5    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [13]:
res1 = pd.concat([df, df1])
print(res1)

     Name  Age    Address Qualification  Mobile No  Salary
0     Jai   27     Nagpur           Msc       97.0     NaN
1  Princi   24     Kanpur            MA       91.0     NaN
2  Gaurav   22  Allahabad           MCA       58.0     NaN
3    Anuj   32    Kannuaj           Phd       76.0     NaN
2  Gaurav   22  Allahabad           MCA        NaN  1000.0
3    Anuj   32    Kannuaj           Phd        NaN  2000.0
6  Dhiraj   12  Allahabad          Bcom        NaN  3000.0
7  Hitesh   52    Kannuaj        B.hons        NaN  4000.0

In [14]:
#Concatenating Mixed DataFrames and Series
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data1,index=[0, 1, 2, 3])

s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')

print(df, "\n\n", s1)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannuaj           Phd

 0    1000
1    2000
2    3000
3    4000
Name: Salary, dtype: int64

In [15]:
res = pd.concat([df, s1], axis = 1)
print(res)

     Name  Age    Address Qualification  Salary
0     Jai   27     Nagpur           Msc    1000
1  Princi   24     Kanpur            MA    2000
2  Gaurav   22  Allahabad           MCA    3000
3    Anuj   32    Kannuaj           Phd    4000

#merging

In [ ]:
merging is used when no columns are common in two datasets, only one cmmon column used to join

In [16]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)


print(df, "\n\n", df1)

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

   key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [18]:
res = pd.merge(df, df1, on ="key")
print(res)

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [19]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)


print(df, "\n\n", df1)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [21]:
#merging dataFrames using multiple keys
res = pd.merge(df, df1, on=['key', 'key1'])
print(res)

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [22]:
#Left join 
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)


print(df, "\n\n", df1)

  key key1    Name  Age
0  K0   K0     Jai   27
1  K1   K1  Princi   24
2  K2   K0  Gaurav   22
3  K3   K1    Anuj   32

   key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [23]:
res = pd.merge(df, df1, how="left", on=['key', 'key1'])
print(res)

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K1   K1  Princi   24        NaN           NaN
2  K2   K0  Gaurav   22  Allahabad          Bcom
3  K3   K1    Anuj   32        NaN           NaN

In [24]:
#Right join
res = pd.merge(df, df1, how="right", on=['key', 'key1'])
print(res)

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K0     NaN   NaN     Kanpur           B.A
2  K2   K0  Gaurav  22.0  Allahabad          Bcom
3  K3   K0     NaN   NaN    Kannuaj        B.hons

In [25]:
#inner join
res = pd.merge(df, df1, how="inner", on=['key', 'key1'])
print(res)

  key key1    Name  Age    Address Qualification
0  K0   K0     Jai   27     Nagpur         Btech
1  K2   K0  Gaurav   22  Allahabad          Bcom

In [26]:
#outer join
res = pd.merge(df, df1, how="outer", on=['key', 'key1'])
print(res)

  key key1    Name   Age    Address Qualification
0  K0   K0     Jai  27.0     Nagpur         Btech
1  K1   K1  Princi  24.0        NaN           NaN
2  K2   K0  Gaurav  22.0  Allahabad          Bcom
3  K3   K1    Anuj  32.0        NaN           NaN
4  K1   K0     NaN   NaN     Kanpur           B.A
5  K3   K0     NaN   NaN    Kannuaj        B.hons

#joining DataFrames

In [28]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32]}

data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])

df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])


print(df, "\n\n", df1)

      Name  Age
K0     Jai   27
K1  Princi   24
K2  Gaurav   22
K3    Anuj   32

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [29]:
res = df.join(df1)    #it is like a left join but no keys
res

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [30]:
res1 = df.join(df1, how="outer")
print(res1)

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

#Sorting in Pandas DataFrame

In [3]:
#Sorting by single column
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}
df = pd.DataFrame(data)

sorted_df = df.sort_values(by='Age')
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [6]:
sort_df = df.sort_values(by="Age", ascending = False)
print(sort_df)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [10]:
#sorting by multiple columns
sort_df = df.sort_values(by=["Age", "Score"])
print(sort_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [13]:
data_with_nan = {"Name": ["Alice", "Bob", "Charlie", "David"],"Age": [28, 22, None, 22]}
df_nan = pd.DataFrame(data_with_nan)
print(df_nan)

      Name   Age
0    Alice  28.0
1      Bob  22.0
2  Charlie   NaN
3    David  22.0

In [12]:
#sorting dataframe with nan
sort_df = df_nan.sort_values(by="Age", na_position = "first")
print(sort_df)

      Name   Age
2  Charlie   NaN
1      Bob  22.0
3    David  22.0
0    Alice  28.0

In [15]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}
df = pd.DataFrame(data)
print(df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [16]:
#sorting by using index
sorted = df.sort_index()
print(sorted)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [18]:
sorted = df.sort_index(ascending = False)
print(sorted)

      Name  Age  Score
3    David   40     80
2  Charlie   35     95
1      Bob   30     90
0    Alice   25     85

In [ ]:
#choosing a sorting algorithm

In [21]:
sorted_res = df.sort_values(by = "Age", kind = "quicksort")
print(sorted_res)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [22]:
sorted_res = df.sort_values(by = "Age", kind = "mergesort")
print(sorted_res)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

In [23]:
sorted_res = df.sort_values(by = "Age", kind = "heapsort")
print(sorted_res)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

#Pivot Tables in Pandas

In [24]:
df = pd.DataFrame({'Product': ['Carrots', 'Broccoli', 'Banana', 'Banana',
                               'Beans', 'Orange', 'Broccoli', 'Banana'],
                   'Category': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit',
                                'Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
                   'Quantity': [8, 5, 3, 4, 5, 9, 11, 8],
                   'Amount': [270, 239, 617, 384, 626, 610, 62, 90]})
df

    Product   Category  Quantity  Amount
0   Carrots  Vegetable         8     270
1  Broccoli  Vegetable         5     239
2    Banana      Fruit         3     617
3    Banana      Fruit         4     384
4     Beans  Vegetable         5     626
5    Orange      Fruit         9     610
6  Broccoli  Vegetable        11      62
7    Banana      Fruit         8      90

In [26]:
#Total sales product wise
res_piv = df.pivot_table(index=["Product"], values=["Amount"], aggfunc="sum")
print(res_piv)

          Amount
Product
Banana      1091
Beans        626
Broccoli     301
Carrots      270
Orange       610

In [27]:
#Total sales category wse
res_piv = df.pivot_table(index=["Category"], values=["Amount"], aggfunc="sum")
print(res_piv)

           Amount
Category
Fruit        1701
Vegetable    1197

In [30]:
#total sales by both product and category wise
res_piv = df.pivot_table(index=["Product", "Category"], values=["Amount"], aggfunc="sum")
print(res_piv)

                    Amount
Product  Category
Banana   Fruit        1091
Beans    Vegetable     626
Broccoli Vegetable     301
Carrots  Vegetable     270
Orange   Fruit         610

In [31]:
#getting the mean, median , min product wise
res_piv = df.pivot_table(index = ["Product"], values = ["Amount"], aggfunc=["mean", "median", "min"])
print(res_piv)

                mean median    min
              Amount Amount Amount
Product
Banana    363.666667  384.0     90
Beans     626.000000  626.0    626
Broccoli  150.500000  150.5     62
Carrots   270.000000  270.0    270
Orange    610.000000  610.0    610

In [32]:
#getting the mean, median , min category wise
res_piv = df.pivot_table(index = ["Category"], values = ["Amount"], aggfunc=["mean", "median", "min"])
print(res_piv)

             mean median    min
           Amount Amount Amount
Category
Fruit      425.25  497.0     90
Vegetable  299.25  254.5     62

#Reading CSV files with Pandas

In [33]:
df1 = pd.read_csv("people_data.csv")
print(df1)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [34]:
df2 = pd.read_csv("people_data.csv", usecols = ["First Name", "Email"])
print(df2)

  First Name                       Email
0     Shelby        elijah57@example.net
1    Phillip       bethany14@example.com
2   Kristine       bthompson@example.com
3    Yesenia   kaitlinkaiser@example.com
4       Lori  buchananmanuel@example.net

In [35]:
df2 = pd.read_csv("people_data.csv", index_col = "First Name")
print(df2)

           Last Name     Sex                       Email Date of birth  \
First Name
Shelby       Terrell    Male        elijah57@example.net    1945-10-26
Phillip      Summers  Female       bethany14@example.com    1910-03-24
Kristine      Travis    Male       bthompson@example.com    1992-07-02
Yesenia     Martinez    Male   kaitlinkaiser@example.com    2017-08-03
Lori            Todd    Male  buchananmanuel@example.net    1938-12-01

                     Job Title
First Name
Shelby         Games developer
Phillip         Phytotherapist
Kristine             Homeopath
Yesenia      Market researcher
Lori        Veterinary surgeon

In [36]:
df2 = pd.read_csv("people_data.csv", nrows = 3)
print(df2)

  First Name Last Name     Sex                  Email Date of birth  \
0     Shelby   Terrell    Male   elijah57@example.net    1945-10-26
1    Phillip   Summers  Female  bethany14@example.com    1910-03-24
2   Kristine    Travis    Male  bthompson@example.com    1992-07-02

         Job Title
0  Games developer
1   Phytotherapist
2        Homeopath

In [37]:
df2 = pd.read_csv("people_data.csv", na_values = ["N/A", "unknown"])
print(df2)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [38]:
df2 = pd.read_csv("people_data.csv", skiprows = [1, 2])
print(df2)

  First Name Last Name   Sex                       Email Date of birth  \
0   Kristine    Travis  Male       bthompson@example.com    1992-07-02
1    Yesenia  Martinez  Male   kaitlinkaiser@example.com    2017-08-03
2       Lori      Todd  Male  buchananmanuel@example.net    1938-12-01

            Job Title
0           Homeopath
1   Market researcher
2  Veterinary surgeon

In [42]:
df2 = pd.read_csv("people_data.csv", parse_dates = ["Date of birth"])
print(df2)

  First Name Last Name     Sex                       Email Date of birth  \
0     Shelby   Terrell    Male        elijah57@example.net    1945-10-26
1    Phillip   Summers  Female       bethany14@example.com    1910-03-24
2   Kristine    Travis    Male       bthompson@example.com    1992-07-02
3    Yesenia  Martinez    Male   kaitlinkaiser@example.com    2017-08-03
4       Lori      Todd    Male  buchananmanuel@example.net    1938-12-01

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

important attributes in reading csv files in pandas
- usecols
- index_col
- na_values
- nrows
- parse_dates 
- skiprows

#Saving Pandas Datframe to CSV

In [46]:
nme = ["aparna", "pankaj", "sudhir", "Geeku"]
deg = ["MBA", "BCA", "M.Tech", "MBA"]
scr = [90, 40, 80, 98]
dict = {"name":nme, "degree":deg, "Score":scr}
df = pd.DataFrame(dict)
print(df)

     name  degree  Score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [47]:
#savimg file to a current wokring directory
df.to_csv("file1.csv")

In [50]:
#saving file to a specific location
df.to_csv(r'c:\Documents\file2.csv')

#data Cleaning in Pandas

In [51]:
d = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score': [np.nan, 40, 80, 98]}
df = pd.DataFrame(d)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [52]:
#findig missing values in datset
print(df.isnull())

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [56]:
#Finding missing values
df = pd.read_csv("employees.csv")
miss = df.isnull()
print(miss[115:125])

     First Name  Gender  Start Date  Last Login Time  Salary  Bonus %  \
115       False   False       False            False   False    False
116        True   False       False            False   False    False
117       False   False       False            False   False    False
118       False   False       False            False   False    False
119       False   False       False            False   False    False
120       False   False       False            False   False    False
121       False    True       False            False   False    False
122       False   False       False            False   False    False
123       False   False       False            False   False    False
124       False   False       False            False   False    False

     Senior Management   Team
115              False  False
116               True  False
117              False  False
118              False  False
119              False  False
120              False  False
121              False  False
122              False  False
123              False  False
124              False  False

In [57]:
#filtering data based on missing values
bool_val = pd.isnull(df['Gender'])
missing_val = df[bool_val]
print(missing_val)

    First Name Gender  Start Date Last Login Time  Salary  Bonus %  \
20        Lois    NaN   4/22/1995         7:18 PM   64714    4.934
22      Joshua    NaN    3/8/2012         1:58 AM   90816   18.816
27       Scott    NaN   7/11/1991         6:58 PM  122367    5.218
31       Joyce    NaN   2/20/2005         2:40 PM   88657   12.752
41   Christine    NaN   6/28/2015         1:08 AM   66582   11.308
..         ...    ...         ...             ...     ...      ...
961    Antonio    NaN   6/18/1989         9:37 PM  103050    3.050
972     Victor    NaN   7/28/2006         2:49 PM   76381   11.159
985    Stephen    NaN   7/10/1983         8:10 PM   85668    1.909
989     Justin    NaN   2/10/1991         4:58 PM   38344    3.794
995      Henry    NaN  11/23/2014         6:09 AM  132483   16.655

    Senior Management                  Team
20               True                 Legal
22               True       Client Services
27              False                 Legal
31              False               Product
41               True  Business Development
..                ...                   ...
961             False                 Legal
972              True                 Sales
985             False                 Legal
989             False                 Legal
995             False          Distribution

[145 rows x 8 columns]

In [58]:
#finding not null values
res = df.notnull()
print(res[25:136])

     First Name  Gender  Start Date  Last Login Time  Salary  Bonus %  \
25        False    True        True             True    True     True
26         True    True        True             True    True     True
27         True   False        True             True    True     True
28         True    True        True             True    True     True
29         True    True        True             True    True     True
..          ...     ...         ...              ...     ...      ...
131        True    True        True             True    True     True
132        True    True        True             True    True     True
133        True    True        True             True    True     True
134        True    True        True             True    True     True
135        True    True        True             True    True     True

     Senior Management  Team
25               False  True
26                True  True
27                True  True
28                True  True
29                True  True
..                 ...   ...
131               True  True
132               True  True
133               True  True
134               True  True
135               True  True

[111 rows x 8 columns]

In [61]:
#filtering
msg = pd.notnull(df['Gender'])
mis = df[msg]
display(mis)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

#Filling missing values in Pandas

In [ ]:
- using fillna()

In [65]:
data=df.fillna(0)
data[115:125]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
115,Pamela,Female,7/1/1982,6:51 AM,54585,4.166,False,Product
116,0,Male,6/22/1991,8:58 PM,76189,18.988,0,Legal
117,Steven,Male,3/1/1995,3:03 PM,109095,9.494,False,Finance
118,Andrea,Female,1/12/2012,5:43 AM,120204,9.557,False,Business Development
119,Paul,Male,6/3/2008,3:05 PM,41054,12.299,False,Marketing
120,Peter,Male,11/17/1994,6:15 PM,84885,15.402,False,Business Development
121,Kathleen,0,5/9/2016,8:55 AM,119735,18.740,False,Product
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
123,Helen,Female,11/29/2001,2:30 AM,73789,14.841,True,Product
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product

In [66]:
#filling with forawrd values
data = df.fillna(method = 'pad')
data[115:125]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
115,Pamela,Female,7/1/1982,6:51 AM,54585,4.166,False,Product
116,Pamela,Male,6/22/1991,8:58 PM,76189,18.988,False,Legal
117,Steven,Male,3/1/1995,3:03 PM,109095,9.494,False,Finance
118,Andrea,Female,1/12/2012,5:43 AM,120204,9.557,False,Business Development
119,Paul,Male,6/3/2008,3:05 PM,41054,12.299,False,Marketing
120,Peter,Male,11/17/1994,6:15 PM,84885,15.402,False,Business Development
121,Kathleen,Male,5/9/2016,8:55 AM,119735,18.740,False,Product
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
123,Helen,Female,11/29/2001,2:30 AM,73789,14.841,True,Product
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product

In [67]:
#filling with backward values
ata = df.fillna(method = 'bfill')
data[115:125]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
115,Pamela,Female,7/1/1982,6:51 AM,54585,4.166,False,Product
116,Pamela,Male,6/22/1991,8:58 PM,76189,18.988,False,Legal
117,Steven,Male,3/1/1995,3:03 PM,109095,9.494,False,Finance
118,Andrea,Female,1/12/2012,5:43 AM,120204,9.557,False,Business Development
119,Paul,Male,6/3/2008,3:05 PM,41054,12.299,False,Marketing
120,Peter,Male,11/17/1994,6:15 PM,84885,15.402,False,Business Development
121,Kathleen,Male,5/9/2016,8:55 AM,119735,18.740,False,Product
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
123,Helen,Female,11/29/2001,2:30 AM,73789,14.841,True,Product
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product

In [68]:
df['Gender'].fillna('No Gender', inplace = True)
df[115:125]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
115,Pamela,Female,7/1/1982,6:51 AM,54585,4.166,False,Product
116,NaN,Male,6/22/1991,8:58 PM,76189,18.988,NaN,Legal
117,Steven,Male,3/1/1995,3:03 PM,109095,9.494,False,Finance
118,Andrea,Female,1/12/2012,5:43 AM,120204,9.557,False,Business Development
119,Paul,Male,6/3/2008,3:05 PM,41054,12.299,False,Marketing
120,Peter,Male,11/17/1994,6:15 PM,84885,15.402,False,Business Development
121,Kathleen,No Gender,5/9/2016,8:55 AM,119735,18.740,False,Product
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
123,Helen,Female,11/29/2001,2:30 AM,73789,14.841,True,Product
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product

In [70]:
#using replace()
data = df.replace(to_replace=np.nan, value = -99)
display(data[115:125])

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
115,Pamela,Female,7/1/1982,6:51 AM,54585,4.166,False,Product
116,-99,Male,6/22/1991,8:58 PM,76189,18.988,-99,Legal
117,Steven,Male,3/1/1995,3:03 PM,109095,9.494,False,Finance
118,Andrea,Female,1/12/2012,5:43 AM,120204,9.557,False,Business Development
119,Paul,Male,6/3/2008,3:05 PM,41054,12.299,False,Marketing
120,Peter,Male,11/17/1994,6:15 PM,84885,15.402,False,Business Development
121,Kathleen,No Gender,5/9/2016,8:55 AM,119735,18.740,False,Product
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
123,Helen,Female,11/29/2001,2:30 AM,73789,14.841,True,Product
124,Marilyn,Female,11/16/1983,8:29 AM,76078,2.401,True,Product

In [71]:
#Dropping Rows with At Least One Null Value
dict = {'First Score': [100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, 40, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [72]:
#Dropping Rows with All Null Values
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [np.nan, np.nan, np.nan, 65]}
df = pd.DataFrame(dict)

df.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

In [73]:
#Dropping Columns with At Least One Null Value
dict = {'First Score': [100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score': [52, np.nan, 80, 98],
        'Fourth Score': [60, 67, 68, 65]}
df = pd.DataFrame(dict)

df.dropna(axis=1)

   Fourth Score
0            60
1            67
2            68
3            65

#removing duplicate rows

In [76]:
data = {
    "Name": ["Alice", "Bob", "Alice", "David"],
    "Age": [25, 30, 25, 40],
    "City": ["NY", "LA", "NY", "Chicago"]
}

df1 = pd.DataFrame(data)
cleaned_df = df1.drop_duplicates()
print(cleaned_df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [80]:
#dropping duplicates based on specific condition
df_cleaned = df.drop_duplicates(subset=["Name"])
print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [81]:
#Keeping the Last Occurrence of Duplicates
df_cleaned = df.drop_duplicates(keep= 'last')
df_cleaned

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [82]:
#Dropping All Duplicates
df_cleaned = df.drop_duplicates(keep=False)
df_cleaned

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [83]:
#Modifying the Original DataFrame Directly
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David'],
    'Age': [25, 30, 25, 40],
    'City': ['NY', 'LA', 'NY', 'Chicago']
})
df.drop_duplicates(inplace=True)
print(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [84]:
#Dropping Duplicates Based on Partially Identical Columns
df_cleaned = df.drop_duplicates(subset=["Name", "City"])

print(df_cleaned)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago